# -*- coding: UTF-8 -*-
# Public package
# Private package

def pika():
    '''
    输出一个皮卡丘\n
    输出一个皮卡丘
    '''
    output = '''
____________________________________________________________________________ 　　
|　 　/＼　  　  ／|                                                        |
|　  /　│　　 ／　／                                                        |
|　 │　 L＿,＜　／ 　   /`ヽ       This code is supported by Zuohong Lei.   |
|　 │　　　　　ヽ　    /＼　〉                                              |
|　  Y　　　　　ヽ　  /　　/       QQ: 791397845                            |
|　 ｲ●　､　●　　 |  〈　　/        Phone: +86 18702767538                   |
|　()　 へ　 ()　|　  ＼〈         E-mail: leizuoho@mail.ustc.edu.cn        |
|　　>ｰ ､_　 ィ　 │   ／／                                                  |
|　 / へ　　 /　ﾉ＜|  ＼＼                                                  |
|　 ヽ_ﾉ　　(_／　 │ ／／                                                   |
|　　7　　　　　　　|／                                                     |
|　　＞―r￣￣`ｰ―＿―|                                                        |
L___________________________________________________________________________|
    '''
    return output
